/*******************************************************************/
/* WMPU860 BOARD HEADER                                            */
/* -WMPU860 Board와 관련된 정의는 여기서 기술한다.                 */
/*******************************************************************/
#ifndef _WMPU860_H_
#define _WMPU860_H_

/**********************************************************
	WMPU860 입출력 포트
/*********************************************************/
#define RS232_PORT1	"/tyCo/0"
#define RS232_PORT2	"/tyCo/1"
#define RS485_PORT1	"/ScctyCo/2"
#define RS485_PORT2	"/ScctyCo/3"

#endif