/*******************************************************************/
/* OPERATION HEADER                                                */
/* -TMS의 연산과 관련된 정의는 여기서 한다.                        */
/*******************************************************************/
#ifndef _OPERATION_H_
#define _OPERATION_H_

#include "ds1647.h"


#define MAX_FAULTLIST	100	/* 고장 관련 내용, 배열: 고장코드*/
#define MAX_SUMMERY		500	/* 고장요약 최대값 */


#define NOTCH_EB			8
#define NOTCH_B7			7
#define NOTCH_B6			6
#define NOTCH_B5			5
#define NOTCH_B4			4
#define NOTCH_B3			3
#define NOTCH_B2			2
#define NOTCH_B1			1
#define NOTCH_N				0

#define ATCCODE_CUT		10
#define ATCCODE_FLT		9
#define ATCCODE_100YC	8
#define ATCCODE_100		7
#define ATCCODE_80		6
#define ATCCODE_70		5
#define ATCCODE_60		4
#define ATCCODE_40		3
#define ATCCODE_25		2
#define ATCCODE_25Y		1
#define ATCCODE_NONE	0

#define DOOR_CLOSE		0
#define DOOR_OPEN		1



typedef struct	/* 고장리스트 구조 */
{
	USHORT wFltIndex;		/* 고장코드: 고장 배열 순서 */
	USHORT wCarHo;			/* 차량호차 0 ~ 7 */
	DATE_TIME_TYPE sTime;	/* 발생/소멸 시각 (7 byte)*/

	UCHAR bChecked	:1;		/* 확인버튼을 눌렀을때 */
	UCHAR			:1;
    UCHAR			:1;
    UCHAR 			:1;
    UCHAR 			:1;
    UCHAR			:1;
    UCHAR			:1;
    UCHAR			:1;

	USHORT wMentIndex;		/* 조치멘트 Index 1,2,3 */

	UINT dwGmFront;			/* 고장의 기록 위치 */
	

} FAULTLIST,*PFAULTLIST;

typedef struct	/* 고장요약 구조 */
{
	BYTE chLevel;				/* 고장레벨 */
	BYTE bMajorFault;			/* 중고장 : Status Trace 기록 여부 */
	UINT wFltCode;				/* 고장코드 예) 11101 */
	USHORT wMentNo[3];			/* 조치사항 참조 코드 */
	BYTE szName[50];			/* 고장명 */
} FLTSUMMERYTYPE,*PFLTSUMMERYTYPE;

#define FL_NONE			0		/* 고장아님 */
#define FL_NSDD			1		/* 기록전용 레벨 고장 */
#define FL_MINOR		2		/* 화면이 변경없는 레벨 고장 */
#define FL_MIDIUM		3		/* 화면이 변경되는 레벨 고장 */


static FLTSUMMERYTYPE m_FaultSummery[MAX_SUMMERY] = 
{
	/* 000 */ {3,0,   0, {    0 ,    0 ,    0 } ,"Invalide Fault"},
	/* 001 */ {3,0,  10, {    1 ,    0 ,    0 } ,"TGIS 작동 불능"},
	/*_002 */ {3,0,  11, {    1 ,    0 ,    0 } ,"TGIS 데이터 버스 고장"},
	/* 003 */ {3,0,  71, {    2 ,    0 ,    0 } ,"TGIS SPU 고장"},
	/* 004 */ {3,0,  72, {    2 ,    0 ,    0 } ,"TGIS IIF 모듈 1 고장"},
	/* 005 */ {3,0,  73, {    2 ,    0 ,    0 } ,"TGIS IIF 모듈 2 고장"},
	/* 006 */ {3,0,  74, {    2 ,    0 ,    0 } ,"TGIS IIF 모듈 3 고장"},
	/* 007 */ {3,0,  75, {    2 ,    0 ,    0 } ,"TGIS IIF 모듈 4 고장"},
	/* 008 */ {3,0,  76, {    2 ,    0 ,    0 } ,"TGIS IIF 모듈 5 고장"},
	/*_009 */ {3,0,  78, {    2 ,    0 ,    0 } ,"TGIS 유니트 전송 고장"},
	/* 010 */ {3,0,  79, {    3 ,    0 ,    0 } ,"화면장치 고장"},
	/* 011 */ {3,0,  80, {    3 ,    0 ,    0 } ,"화면장치 전송 고장"},
	/* 012 */ {3,0,  81, {    4 ,    0 ,    0 } ,"카드 리더 고장"},
	/* 013 */ {3,0,  82, {    4 ,    0 ,    0 } ,"카드 리더 전송 고장"},
	/* 014 */ {3,0,  83, {    5 ,    0 ,    0 } ,"카드 리더에 운행기록 카드 없음"},
	/* 015 */ {3,0,  84, {    6 ,    0 ,    0 } ,"IC Card에 기록 불가능"},
	/*_016 */ {3,1, 110, {    7 ,    0 ,    0 } ,"ATC 고장"},
	/*_017 */ {3,1, 210, {    9 ,   10 ,   11 } ,"동력(M)차 개방"},
	/*_018 */ {3,1, 211, {   12 ,   14 ,    0 } ,"C/I 과전류"},
	/*_019 */ {3,1, 212, {   15 ,   19 ,    0 } ,"C/I PWM 고장"},
	/*_020 */ {3,1, 213, {   17 ,    0 ,    0 } ,"C/I 전원 장치 고장"},
	/*_021 */ {3,1, 214, {   12 ,   14 ,    0 } ,"HSCB 고장"},
	/*_022 */ {3,1, 215, {   12 ,   13 ,    0 } ,"C/I 24V 전원공급 PSU 고장"},
	/*_023 */ {3,1, 216, {   12 ,   14 ,    0 } ,"C/I GTO 고장"},
	/*_024 */ {3,1, 217, {   12 ,   14 ,    0 } ,"C/I A상 고장"},
	/*_025 */ {3,1, 218, {   12 ,   14 ,    0 } ,"C/I B상 고장"},
	/*_026 */ {3,1, 219, {   12 ,   14 ,    0 } ,"C/I C상 고장"},
	/*_027 */ {3,1, 220, {   19 ,   21 ,    0 } ,"C/I 방향 고장"},
	/*_028 */ {3,1, 221, {   12 ,   13 ,    0 } ,"C/I 필터 캐패시터 고장"},
	/*_029 */ {3,1, 222, {   12 ,   14 ,    0 } ,"C/I 라인 과전압"},
	/*_030 */ {3,1, 223, {   20 ,    0 ,    0 } ,"C/I 피크 전류 억제 고장"},
	/*_031 */ {3,1, 224, {   12 ,   14 ,    0 } ,"C/I 크로우바 통전"},
	/*_032 */ {3,1, 225, {   12 ,   14 ,    0 } ,"C/I 캐패시터 충전고장"},
	/*_033 */ {3,1, 226, {   12 ,   13 ,    0 } ,"C/I 충전회로 고장"},
	/*_034 */ {3,1, 227, {   21 ,    0 ,    0 } ,"C/I 인터록 기능 고장"},
	/*_035 */ {3,1, 228, {   21 ,    0 ,    0 } ,"C/I 자기진단 테스트 고장"},
	/*_036 */ {3,1, 229, {   12 ,   14 ,    0 } ,"C/I 전류 변환기 고장"},
	/*_037 */ {3,0, 270, {   18 ,    0 ,    0 } ,"C/I 전송고장"},
	/*_038 */ {3,1, 271, {   16 ,    0 ,    0 } ,"C/I 속도센서 1고장"},
	/*_039 */ {3,1, 272, {   16 ,    0 ,    0 } ,"C/I 속도센서 2고장"},
	/*_040 */ {3,1, 273, {   16 ,    0 ,    0 } ,"C/I 속도센서 3고장"},
	/*_041 */ {3,1, 274, {   16 ,    0 ,    0 } ,"C/I 속도센서 4고장"},
	/*_042 */ {3,1, 275, {   15 ,    0 ,    0 } ,"승객하중 검지기능 고장"},
	/*_043 */ {3,1, 300, {   25 ,    0 ,    0 } ,"제동 유니트 이상"},
	/*_044 */ {3,1, 301, {   25 ,    0 ,    0 } ,"제동 실린더 이상"},
	/*_045 */ {3,1, 310, {   26 ,    0 ,    0 } ,"제동완해 불능"},
	/*_046 */ {3,1, 311, {   27 ,    0 ,    0 } ,"제동력 부족"},
	/*_047 */ {3,1, 312, {   28 ,    0 ,    0 } ,"MRPS 공기압력 저하"},
	/*_048 */ {3,1, 313, {   29 ,    0 ,    0 } ,"PANPS1 공기압력 저하"},
	/*_049 */ {3,1, 314, {   29 ,    0 ,    0 } ,"PANPS2 공기압력 저하"},
	/*_050 */ {3,1, 315, {   31 ,    0 ,    0 } ,"제동제어전원 공급이상"},
	/*_051 */ {3,1, 316, {   31 ,    0 ,    0 } ,"제동 유니트 PSU 고장"},
	/*_052 */ {3,1, 317, {   30 ,    0 ,    0 } ,"PBPS 압력 저하"},
	/*_053 */ {3,1, 318, {   31 ,    0 ,    0 } ,"제동 RAM 진단고장"},
	/*_054 */ {3,1, 319, {   31 ,    0 ,    0 } ,"제동 테스트 점검 이상"},
	/*_055 */ {3,1, 340, {   33 ,    0 ,    0 } ,"A/S Puncture1"},
	/*_056 */ {3,1, 341, {   33 ,    0 ,    0 } ,"A/S Puncture2"},
	/*_057 */ {3,1, 374, {   32 ,    0 ,    0 } ,"승객하중 신호이상"},
	/*_058 */ {3,1, 375, {   32 ,    0 ,    0 } ,"회생 BE 실현치 신호이상"},
	/*_059 */ {3,1, 376, {   32 ,    0 ,    0 } ,"EP밸브 전류이상 M차"},
	/*_060 */ {3,1, 377, {   32 ,    0 ,    0 } ,"EP밸브 전류이상 T차"},
	/*_061 */ {3,1, 378, {   32 ,    0 ,    0 } ,"회생제동 Feed Back 고장"},
	/*_062 */ {3,1, 379, {   63 ,    0 ,    0 } ,"ASCU 고장"},
	/*_063 */ {3,0, 380, {   34 ,    0 ,    0 } ,"제동유니트 전송 고장"},
	/*_064 */ {3,1, 410, {   35 ,    0 ,    0 } ,"보조전원 이상"},
	/*_065 */ {3,1, 441, {   36 ,   39 ,    0 } ,"SIV 쵸퍼 1과전압"},
	/*_066 */ {3,1, 442, {   36 ,   39 ,    0 } ,"SIV 쵸퍼 2과전압"},
	/*_067 */ {3,1, 443, {   36 ,   39 ,    0 } ,"SIV 쵸퍼 1과전류"},
	/*_068 */ {3,1, 444, {   36 ,   39 ,    0 } ,"SIV 쵸퍼 2과전류"},
	/*_069 */ {3,1, 445, {   36 ,   39 ,    0 } ,"SIV 인버터 1과전압"},
	/*_070 */ {3,1, 446, {   36 ,   39 ,    0 } ,"SIV 인버터 2과전압"},
	/*_071 */ {3,1, 447, {   36 ,   39 ,    0 } ,"SIV 인버터 1과전류"},
	/*_072 */ {3,1, 448, {   36 ,   39 ,    0 } ,"SIV 인버터 2과전류"},
	/*_073 */ {3,1, 449, {   36 ,   39 ,    0 } ,"SIV 입력 DC 과전압"},
	/*_074 */ {3,1, 450, {   36 ,   39 ,    0 } ,"SIV 입력 DC 저전압"},
	/*_075 */ {3,1, 451, {   36 ,   39 ,    0 } ,"SIV 입력 AC 과전압"},
	/*_076 */ {3,1, 452, {   36 ,   39 ,    0 } ,"SIV 입력 AC 저전압"},
	/*_077 */ {3,1, 453, {   36 ,    0 ,    0 } ,"SIV AC 출력 저전압"},
	/*_078 */ {3,1, 454, {   36 ,    0 ,    0 } ,"SIV AC 출력 단락"},
	/*_079 */ {3,1, 455, {   36 ,   39 ,    0 } ,"SIV 필터 콘덴서 분압이상"},
	/*_080 */ {3,1, 456, {   36 ,   39 ,    0 } ,"SIV 제어 전원 고장"},
	/*_081 */ {3,1, 457, {   37 ,    0 ,    0 } ,"밧데리 충전 장치 고장"},
	/*_082 */ {3,1, 458, {   36 ,   39 ,    0 } ,"SIV 보조 RF 휴즈 차단"},
	/*_083 */ {3,1, 459, {   36 ,   39 ,    0 } ,"SIV 입력 휴트 차단"},
	/*_084 */ {3,1, 460, {   36 ,   39 ,    0 } ,"SIV 기동 이상"},
	/*_085 */ {3,1, 461, {   36 ,   39 ,    0 } ,"SIV CPU 카드 고장"},
	/*_086 */ {3,1, 462, {   36 ,   39 ,    0 } ,"SIV PLC 카드 고장"},
	/*_087 */ {3,1, 463, {   36 ,   39 ,    0 } ,"SIV 과온"},
	/*_088 */ {3,1, 464, {   36 ,    0 ,    0 } ,"SIV 전원 장치 고장"},
	/*_089 */ {3,1, 465, {   36 ,    0 ,    0 } ,"SIV AC 출력 차단"},
	/*_090 */ {3,0, 470, {   38 ,    0 ,    0 } ,"SIV 전송 고장"},
	/*_091 */ {3,0, 570, {   40 ,    0 ,    0 } ,"자동 방송 장치 고장"},
	/*_092 */ {3,0, 571, {   41 ,    0 ,    0 } ,"행선 표시기 1 고장"},
	/*_093 */ {3,0, 572, {   41 ,    0 ,    0 } ,"행선 표시기 2 고장"},
	/*_094 */ {3,0, 573, {   41 ,    0 ,    0 } ,"행선 표시기 3 고장"},
	/*_095 */ {3,0, 574, {   42 ,    0 ,    0 } ,"행선 표시기 지령기 고장"},
	/*_096 */ {3,0, 575, {   43 ,    0 ,    0 } ,"객실안내표시 설정기 고장"},
	/*_097 */ {3,0, 576, {   43 ,    0 ,    0 } ,"객실안내표시기 고장"},
	/*_098 */ {3,0, 670, {   44 ,    0 ,    0 } ,"열차무선장치 전원차단"},
	/*_099 */ {3,1, 700, {   45 ,    0 ,    0 } ,"공기압축기 기동 불능"},
	/*_100 */ {3,1, 740, {   46 ,    0 ,    0 } ,"CM 인버터 고장"},
	/* 101 */ {3,1, 991, {    0 ,    0 ,    0 } ,"Door 1닫힘 지연"},
	/* 102 */ {3,1, 992, {    0 ,    0 ,    0 } ,"Door 2닫힘 지연"},
	/* 103 */ {3,1, 993, {    0 ,    0 ,    0 } ,"Door 3닫힘 지연"},
	/* 104 */ {3,1, 994, {    0 ,    0 ,    0 } ,"Door 4닫힘 지연"},
	/* 105 */ {3,1, 995, {    0 ,    0 ,    0 } ,"Door 5닫힘 지연"},
	/* 106 */ {3,1, 996, {    0 ,    0 ,    0 } ,"Door 6닫힘 지연"},
	/* 107 */ {3,1, 997, {    0 ,    0 ,    0 } ,"Door 7닫힘 지연"},
	/* 108 */ {3,1, 998, {    0 ,    0 ,    0 } ,"Door 8닫힘 지연"},



};
PFAULTLIST op_GetTopLevelFault(BOOL bAllCheck);

/******153***************************************************/
/*	외부변수                                             */
/*********************************************************/
extern UINT m_OpCnt;
extern USHORT m_wLevelNotch;
extern UINT m_nFCodeTop;
extern FAULTLIST m_FaultList[MAX_FAULTLIST];

/*********************************************************/
/*	함수 프로토타입                                      */
/*********************************************************/
void op_ArgInit();				/* Arguments 초기화 */
void op_HeadControl();			/* HCR/TCR 제어 */
void op_MakeBrakeProtocol(BOOL bTDC);
void op_MakeSivProtocol(BOOL bTDC);
void op_FaultListCheck(PFAULTLIST pFaultList);

BYTE op_GetSpeed();

#endif